src/ubuntu.org
#+title: Ubuntu
** 写在前面
千万不要抱有一朝一兮就可以搞定的想法。最好的话身边有一个群体，大家都使用Ubuntu这个东西。这样如果有什么问题的话，大家就比较容易找到解决办法，直到自己完全适应为止。推荐安装下面这些软件：

UPDATE(2017-10-04): 这几天又重新安装ubuntu，觉得这个东西很多组件都没有带上。转了一圈之后觉得deepin可能还不错，所以就试试这个东西。用下来感觉还不错，几个比较方便的东西：
1. 自带了搜狗输入法
2. vpn支持l2tp, 这点非常重要
3. AppStore里面带了很多使用了Wine包装过的程序，比如微信和QQ等
感觉deepin非常适合中国人民使用。相比Ubuntu来说，本地化工作做的好太多了。

Desktop Applications:
- sudo apt-get install emacs24
- sudo apt-get install vlc # 视频
- sudo apt-get install okular # pdf阅读
- sudo apt-get install kchmviewer # chm阅读
- #sudo apt-get install kdenlive # 视频编辑
- #sudo apt-get install recordmydesktop # 录制桌面
- sudo apt-get install zsh
- sudo apt-get install vim
- sudo apt-get install fcitx
- sudo apt-get install fcitx-googlepinyin
- sudo apt-get install im-config
- sudo apt-get install alarm-clock-applet # 定时闹钟
- sudo apt-get install virtualbox
- sudo apt-get install virtualbox-guest-additions-iso
- sudo apt-get install nautilus-dropbox
- sudo apt-get install shadowsocks-qt5

Development Applications:
- sudo apt-get install linux-tools-common
- sudo apt-get install linux-base
- sudo apt-get install software-properties-common
- sudo apt-get install openjdk-7-jdk
- sudo apt-get install openjdk-7-doc
- sudo apt-get install git
- sudo apt-get install ntp
- sudo apt-get install rar
- sudo apt-get install curl
- sudo apt-get install rsync
- sudo apt-get install screen
- sudo apt-get install maven
- sudo apt-get install scons
- sudo apt-get install cmake
- sudo apt-get install ccache
- sudo apt-get install samba
- sudo apt-get install nginx
- sudo apt-get install docker.io
- sudo apt-get install graphviz
- sudo apt-get install gdebi-core
- sudo apt-get install openvpn
- sudo apt-get install openssh-server
- sudo apt-get install mysql-server
- sudo apt-get install redis-server
- sudo apt-get install markdown
- sudo apt-get install p7zip-full

Performance Tuning:
- sudo apt-get install htop
- sudo apt-get install sysstat
- sudo apt-get install iotop
- sudo apt-get install iftop
- sudo apt-get install google-perftools

Python Libraries:
- sudo apt-get install python-dev
- sudo apt-get install python-doc
- sudo apt-get install ipython
- sudo apt-get install ipython-doc
- sudo apt-get install ipython-notebook
- sudo apt-get install python-setuptools
- sudo apt-get install python-pip
- sudo apt-get install python-redis
- sudo apt-get install python-mysqldb
- sudo apt-get install python-gevent
- sudo apt-get install python-m2crypto
- sudo apt-get install gunicorn

C++ Libraries:
- sudo apt-get install libboost-all-dev
- sudo apt-get install libevent-dev
- sudo apt-get install libssl-dev
- sudo apt-get install libaio-dev
- sudo apt-get install libgoogle-perftools-dev

** 系统配置
*** 察看ubuntu内部版本
lsb_release -a

#+BEGIN_EXAMPLE
➜  note git:(master) ✗ lsb_release -a
No LSB modules are available.
Distributor ID: Ubuntu
Description:    Ubuntu 12.04 LTS
Release:        12.04
Codename:       precise
#+END_EXAMPLE

#note@2014-11-17: upgrade to 'trusty'

#+BEGIN_EXAMPLE
➜  ~  lsb_release -a
No LSB modules are available.
Distributor ID:	Ubuntu
Description:	Ubuntu 14.04.1 LTS
Release:	14.04
Codename:	trusty
#+END_EXAMPLE

*** 重启机器
似乎Ubuntu下面限制用户进行重启，可以使用sudo reboot重启机器。

*** 关闭机器
关闭机器同样需要超级权限，可以使用sudo shutdown 0立即关闭机器。

*** 重启unity
unity restart &

#note: 这种方式可以work但是似乎问题比较多，如果unity出现问题还是重启系统比较方便

*** 设置字符界面启动
- 编辑文件/etc/default/grub
- GRUB_CMDLINE_LINUX_DEFAULT="quiet splash"修改成GRUB_CMDLINE_LINUX_DEFAULT="quiet splash text"
- 运行sudo update-grub

*** 绑定静态IP
修改/etc/network/interfaces
#+BEGIN_EXAMPLE
auto eth0
iface eth0 inet static
address 10.18.102.200
netmask 255.255.255.0
gateway 10.18.102.254
#+END_EXAMPLE

修改/etc/nsswitch.conf
#+BEGIN_EXAMPLE
hosts:          files dns
networks:       files
#+END_EXAMPLE

然后重启网络
#+BEGIN_EXAMPLE
sudo /etc/init.d/networking restart
#+END_EXAMPLE

*** 修改主机名称
- sudo hostname <name>
- vim /etc/hostname

*** root密码
初次启动的时候需要使用sudo passwd root来修改root密码

使用passwd -d <user>可以用来删除密码

