html/ubuntu.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Ubuntu</title>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="dirtysalt" />
<link rel="shortcut icon" href="/themes/favicon.ico" /><link rel="stylesheet" type="text/css" href="/themes/simple.css"/></head>
<body>
<div id="content">
<h1 class="title">Ubuntu</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. 写在前面</a></li>
<li><a href="#sec-2">2. 系统配置</a>
<ul>
<li><a href="#sec-2-1">2.1. 察看ubuntu内部版本</a></li>
<li><a href="#sec-2-2">2.2. 重启机器</a></li>
<li><a href="#sec-2-3">2.3. 关闭机器</a></li>
<li><a href="#sec-2-4">2.4. 重启unity</a></li>
<li><a href="#sec-2-5">2.5. 设置字符界面启动</a></li>
<li><a href="#sec-2-6">2.6. 绑定静态IP</a></li>
<li><a href="#sec-2-7">2.7. 修改主机名称</a></li>
<li><a href="#sec-2-8">2.8. root密码</a></li>
<li><a href="#sec-2-9">2.9. deb使用</a></li>
<li><a href="#sec-2-10">2.10. apt-get: Waiting for headers</a></li>
<li><a href="#sec-2-11">2.11. /sbin/insserv: No such file or directory</a></li>
<li><a href="#sec-2-12">2.12. 允许/禁止服务自动启动</a></li>
<li><a href="#sec-2-13">2.13. 修改分区</a></li>
<li><a href="#sec-2-14">2.14. 设置apt源</a></li>
</ul>
</li>
<li><a href="#sec-3">3. 桌面应用</a>
<ul>
<li><a href="#sec-3-1">3.1. amarok循环播放</a></li>
<li><a href="#sec-3-2">3.2. 设置输入法切换</a></li>
<li><a href="#sec-3-3">3.3. 自动启动输入法</a></li>
<li><a href="#sec-3-4">3.4. google docs不能输入中文</a></li>
<li><a href="#sec-3-5">3.5. 设置默认浏览器</a></li>
<li><a href="#sec-3-6">3.6. thunderbird配置gmail</a></li>
<li><a href="#sec-3-7">3.7. thunderbird的Inbox文件过大</a></li>
<li><a href="#sec-3-8">3.8. 窗口常用快捷键</a></li>
<li><a href="#sec-3-9">3.9. 调整字体大小</a></li>
<li><a href="#sec-3-10">3.10. 调整边栏大小</a></li>
<li><a href="#sec-3-11">3.11. 调整skype字体大小</a></li>
<li><a href="#sec-3-12">3.12. vlc字幕乱码</a></li>
<li><a href="#sec-3-13">3.13. 使用搜狗输入法</a></li>
</ul>
</li>
<li><a href="#sec-4">4. 编程环境</a>
<ul>
<li><a href="#sec-4-1">4.1. bash的tab自动补全</a></li>
<li><a href="#sec-4-2">4.2. 加快ssh登陆</a></li>
<li><a href="#sec-4-3">4.3. 建立ssh信任关系</a></li>
<li><a href="#sec-4-4">4.4. 简化ssh登陆</a></li>
<li><a href="#sec-4-5">4.5. 修改默认shell</a></li>
<li><a href="#sec-4-6">4.6. 关闭ssh host key检查</a></li>
<li><a href="#sec-4-7">4.7. ssh identity file</a></li>
<li><a href="#sec-4-8">4.8. cannot change locale</a></li>
</ul>
</li>
<li><a href="#sec-5">5. 虚拟机</a>
<ul>
<li><a href="#sec-5-1">5.1. vmware虚拟机增加磁盘空间</a></li>
<li><a href="#sec-5-2">5.2. virtualbox安装windows虚拟机</a></li>
<li><a href="#sec-5-3">5.3. virtualbox设置共享文件夹</a></li>
<li><a href="#sec-5-4">5.4. virtualbox下使用U盾</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> 写在前面</h2>
<div class="outline-text-2" id="text-1">
<p>
千万不要抱有一朝一兮就可以搞定的想法。最好的话身边有一个群体，大家都使用Ubuntu这个东西。这样如果有什么问题的话，大家就比较容易找到解决办法，直到自己完全适应为止。推荐安装下面这些软件：
</p>

<p>
UPDATE(2017-10-04): 这几天又重新安装ubuntu，觉得这个东西很多组件都没有带上。转了一圈之后觉得deepin可能还不错，所以就试试这个东西。用下来感觉还不错，几个比较方便的东西：
</p>
<ol class="org-ol">
<li>自带了搜狗输入法
</li>
<li>vpn支持l2tp, 这点非常重要
</li>
<li>AppStore里面带了很多使用了Wine包装过的程序，比如微信和QQ等
</li>
</ol>
<p>
感觉deepin非常适合中国人民使用。相比Ubuntu来说，本地化工作做的好太多了。
</p>

<p>
Desktop Applications:
</p>
<ul class="org-ul">
<li>sudo apt-get install emacs24
</li>
<li>sudo apt-get install vlc # 视频
</li>
<li>sudo apt-get install okular # pdf阅读
</li>
<li>sudo apt-get install kchmviewer # chm阅读
</li>
<li>#sudo apt-get install kdenlive # 视频编辑
</li>
<li>#sudo apt-get install recordmydesktop # 录制桌面
</li>
<li>sudo apt-get install zsh
</li>
<li>sudo apt-get install vim
</li>
<li>sudo apt-get install fcitx
</li>
<li>sudo apt-get install fcitx-googlepinyin
</li>
<li>sudo apt-get install im-config
</li>
<li>sudo apt-get install alarm-clock-applet # 定时闹钟
</li>
<li>sudo apt-get install virtualbox
</li>
<li>sudo apt-get install virtualbox-guest-additions-iso
</li>
<li>sudo apt-get install nautilus-dropbox
</li>
<li>sudo apt-get install shadowsocks-qt5
</li>
</ul>

<p>
Development Applications:
</p>
<ul class="org-ul">
<li>sudo apt-get install linux-tools-common
</li>
<li>sudo apt-get install linux-base
</li>
<li>sudo apt-get install software-properties-common
</li>
<li>sudo apt-get install openjdk-7-jdk
</li>
<li>sudo apt-get install openjdk-7-doc
</li>
<li>sudo apt-get install git
</li>
<li>sudo apt-get install ntp
</li>
<li>sudo apt-get install rar
</li>
<li>sudo apt-get install curl
</li>
<li>sudo apt-get install rsync
</li>
<li>sudo apt-get install screen
</li>
<li>sudo apt-get install maven
</li>
<li>sudo apt-get install scons
</li>
<li>sudo apt-get install cmake
</li>
<li>sudo apt-get install ccache
</li>
<li>sudo apt-get install samba
</li>
<li>sudo apt-get install nginx
</li>
<li>sudo apt-get install docker.io
</li>
<li>sudo apt-get install graphviz
</li>
<li>sudo apt-get install gdebi-core
</li>
<li>sudo apt-get install openvpn
</li>
<li>sudo apt-get install openssh-server
</li>
<li>sudo apt-get install mysql-server
</li>
<li>sudo apt-get install redis-server
</li>
<li>sudo apt-get install markdown
</li>
<li>sudo apt-get install p7zip-full
</li>
</ul>

<p>
Performance Tuning:
</p>
<ul class="org-ul">
<li>sudo apt-get install htop
</li>
<li>sudo apt-get install sysstat
</li>
<li>sudo apt-get install iotop
</li>
<li>sudo apt-get install iftop
</li>
<li>sudo apt-get install google-perftools
</li>
</ul>

<p>
Python Libraries:
</p>
<ul class="org-ul">
<li>sudo apt-get install python-dev
</li>
<li>sudo apt-get install python-doc
</li>
<li>sudo apt-get install ipython
</li>
<li>sudo apt-get install ipython-doc
</li>
<li>sudo apt-get install ipython-notebook
</li>
<li>sudo apt-get install python-setuptools
</li>
<li>sudo apt-get install python-pip
</li>
<li>sudo apt-get install python-redis
</li>
<li>sudo apt-get install python-mysqldb
</li>
<li>sudo apt-get install python-gevent
</li>
<li>sudo apt-get install python-m2crypto
</li>
<li>sudo apt-get install gunicorn
</li>
</ul>

<p>
C++ Libraries:
</p>
<ul class="org-ul">
<li>sudo apt-get install libboost-all-dev
</li>
<li>sudo apt-get install libevent-dev
</li>
<li>sudo apt-get install libssl-dev
</li>
<li>sudo apt-get install libaio-dev
</li>
<li>sudo apt-get install libgoogle-perftools-dev
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> 系统配置</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> 察看ubuntu内部版本</h3>
<div class="outline-text-3" id="text-2-1">
<p>
lsb_release -a
</p>

<pre class="example">
➜  note git:(master) ✗ lsb_release -a
No LSB modules are available.
Distributor ID: Ubuntu
Description:    Ubuntu 12.04 LTS
Release:        12.04
Codename:       precise
</pre>

<p>
#note@2014-11-17: upgrade to 'trusty'
</p>

<pre class="example">
➜  ~  lsb_release -a
No LSB modules are available.
Distributor ID:	Ubuntu
Description:	Ubuntu 14.04.1 LTS
Release:	14.04
Codename:	trusty
</pre>
</div>
</div>

<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> 重启机器</h3>
<div class="outline-text-3" id="text-2-2">
<p>
似乎Ubuntu下面限制用户进行重启，可以使用sudo reboot重启机器。
</p>
</div>
</div>

<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> 关闭机器</h3>
<div class="outline-text-3" id="text-2-3">
<p>
关闭机器同样需要超级权限，可以使用sudo shutdown 0立即关闭机器。
</p>
</div>
</div>

<div id="outline-container-sec-2-4" class="outline-3">
<h3 id="sec-2-4"><span class="section-number-3">2.4</span> 重启unity</h3>
<div class="outline-text-3" id="text-2-4">
<p>
unity restart &amp;
</p>

<p>
#note: 这种方式可以work但是似乎问题比较多，如果unity出现问题还是重启系统比较方便
</p>
</div>
</div>

<div id="outline-container-sec-2-5" class="outline-3">
<h3 id="sec-2-5"><span class="section-number-3">2.5</span> 设置字符界面启动</h3>
<div class="outline-text-3" id="text-2-5">
<ul class="org-ul">
<li>编辑文件/etc/default/grub
</li>
<li>GRUB_CMDLINE_LINUX_DEFAULT="quiet splash"修改成GRUB_CMDLINE_LINUX_DEFAULT="quiet splash text"
</li>
<li>运行sudo update-grub
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2-6" class="outline-3">
<h3 id="sec-2-6"><span class="section-number-3">2.6</span> 绑定静态IP</h3>
<div class="outline-text-3" id="text-2-6">
<p>
修改/etc/network/interfaces
</p>
<pre class="example">
auto eth0
iface eth0 inet static
address 10.18.102.200
netmask 255.255.255.0
gateway 10.18.102.254
</pre>

<p>
修改/etc/nsswitch.conf
</p>
<pre class="example">
hosts:          files dns
networks:       files
</pre>

<p>
然后重启网络
</p>
<pre class="example">
sudo /etc/init.d/networking restart
</pre>
</div>
</div>

<div id="outline-container-sec-2-7" class="outline-3">
<h3 id="sec-2-7"><span class="section-number-3">2.7</span> 修改主机名称</h3>
<div class="outline-text-3" id="text-2-7">
<ul class="org-ul">
<li>sudo hostname &lt;name&gt;
</li>
<li>vim /etc/hostname
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2-8" class="outline-3">
<h3 id="sec-2-8"><span class="section-number-3">2.8</span> root密码</h3>
<div class="outline-text-3" id="text-2-8">
<p>
初次启动的时候需要使用sudo passwd root来修改root密码
</p>

<p>
使用passwd -d &lt;user&gt;可以用来删除密码
</p>
</div>
</div>
