src/ubuntu.org
*** deb使用
安装deb使用命令 sudo dpkg -i test.deb. （使用dpkg并不会自动下载.deb所需要的依赖. 这个工作可以通过gdebi来完成）

通常我们不太清楚一个deb安装了哪些文件，尤其是doc的话可能不知道放置在什么位置上面。我们可以通过搜索引擎查找这个包，然后在 http://packages.ubuntu.com 下面找到这个包以及对应的文件列表信息。

doc存放位置通常在/usr/share/doc/<package>/下面。

使用alien在deb和rpm之间转换
- 安装alien
- rpm转deb sudo alien -d test.rpm
- deb转rpm sudo alien -r test.deb

看了一下alien的help还可和下面几个包格式互转
- slp
- lsb
- tgz
- pkg
甚至可以直接调用alien -i test.rpm直接安装而不需要转换。

使用dpkg --listfiles可以查看安装了哪些文件

-----

使用apt-cache depends <package>可以查看<package>的依赖，rdepends则可是查看反向依赖
#+BEGIN_EXAMPLE
➜  debs git:(devel-yan) ✗ apt-cache rdepends tcpdump
tcpdump
Reverse Depends:
  tcpdump:i386
  kubuntu-active
  tcpdump:i386
  ulogd2-pcap
  tcptrace
  tcpstat
  tcpflow
  ssldump
  python-scapy
  python-ns3-dbg
  python-ns3
  pcapfix
  nstreams
  kubuntu-active
  iptotal
  dhcpdump
  core-network-gui
  core-network
  chaosreader
 |bittwist
  ubuntu-standard
➜  debs git:(devel-yan) ✗ apt-cache depends tcpdump
tcpdump
  Depends: libc6
  Depends: libpcap0.8
  Depends: libssl1.0.0
  Suggests: apparmor
  Conflicts: tcpdump:i386
#+END_EXAMPLE

-----

关于制作deb包，下面两个链接比较有帮助
- Debian Binary Package Building HOWTO : http://tldp.org/HOWTO/html_single/Debian-Binary-Package-Building-HOWTO/ （制作最简单的deb包）
- Debian Policy Manual - Package maintainer scripts and installation procedure : https://www.debian.org/doc/debian-policy/ch-maintainerscripts.html （deb hook脚本运行机制）

*** apt-get: Waiting for headers
http://askubuntu.com/questions/156650/apt-get-update-very-slow-stuck-at-waiting-for-headers

可能是因为网络链接不太好，也可能是因为源服务器不太稳定。如果确定是自己源服务器不太稳定的话，那么可以更换源服务器。

Update Manager -> Settings -> Ubuntu Software -> Download from Other -> Select Best Server

*** /sbin/insserv: No such file or directory
这个命令会在chkconfig(用于配置是否自动启动)里面用到.

#+BEGIN_EXAMPLE
➜  nginx  sudo chkconfig lighttpd off
/sbin/insserv: No such file or directory
#+END_EXAMPLE

解决办法是做个软链接 "sudo ln -s  /usr/lib/insserv/insserv /sbin/insserv"

*** 允许/禁止服务自动启动
chkconfig可以用来配置服务是否自动启动 sudo chkconfig <service> on/off

另外使用chkconfig还可以用来查看当前服务自动启动情况
#+BEGIN_EXAMPLE
➜  nginx  chkconfig
distcc                   on
docker                   off
lighttpd                 off
mysql                    off
nginx                    on
ntp                      on
ondemand                 on
openvpn                  on
redis-server             off
resolvconf               off
rsync                    on
rsyslog                  off
samba                    off
samba-ad-dc              off
saned                    on
screen-cleanup           off
screen-cleanup.dpkg-new  off
sendsigs                 0
smbd                     off
speech-dispatcher        on
ssh                      off
sudo                     on
sysstat                  on
virtualbox               on
virtualbox-guest-utils   on
virtualbox-guest-x11     on
#+END_EXAMPLE

#note@2014-11-30: ubuntu后期版本移除了这个组件,使用sysv-rc-conf来代替. 使用--list可以列出所有当前服务
#+BEGIN_EXAMPLE
➜  .private  sudo sysv-rc-conf --list
collectl     0:off1:off2:on3:on4:on5:on6:off
distcc       0:off1:off2:on3:on4:on5:on6:off
docker
mysql        2:off3:off4:off5:off
ntp          1:off2:on3:on4:on5:on
rc.local     2:on3:on4:on5:on
reboot       6:on
redis-server 0:off1:off2:off3:off4:off5:off6:off
resolvconf
rsync        2:on3:on4:on5:on
rsyslog
samba
sudo         2:on3:on4:on5:on
sysstat      2:on3:on4:on5:on
urandom      0:on6:onS:on
virtualbox   0:off1:off2:on3:on4:on5:on6:off
virtualbox-g 0:off1:off2:on3:on4:on5:on6:off
#+END_EXAMPLE

然后使用sudo sysv-rc-conf <service> on/off 来配置是否自动启动

*** 修改分区
可以使用Ubuntu Disk工具来修改分区。

修改分区之后可能会在启动时候出现错误，显示这些分区不存在无法挂载。可能的原因是这些分区的UUID发生变化，但是在/etc/fstab里面却没有更新过来。

我们可以手工编辑/etc/fstab来更正，可以使用blkid查看各个设备的UUID
#+BEGIN_EXAMPLE
➜  ~  blkid
/dev/sda1: UUID="26971214-3b4d-455c-ab3d-cefae2d8cfd8" TYPE="ext4"
/dev/sda5: LABEL="swap" UUID="cd6de3d9-6a98-46c2-9875-de12251fe82e" TYPE="swap"
/dev/sda6: LABEL="extra" UUID="6ac0d95d-b2fc-426f-bf7b-4a3669442ea6" TYPE="ext4"
/dev/sdb2: UUID="4ed192d5-884b-43a4-904b-fb9cb5f193b2" TYPE="ext4"
#+END_EXAMPLE

*** 设置apt源
好的apt源可以加快软件安装，节省不少时间。默认源mirrors.ubuntu.com离中国比较远所以下载会很慢。

Ubuntu Software Center -> Edit -> Software Sources -> Ubuntu Sofware(Download from)

点击Select Best Server来让自动选择最好的服务器。如果是中国的话可能163.com或者是aliyun.com会比较好点。修改完成后记得要apt-get update.

** 桌面应用
*** amarok循环播放
在amarok的右下角有task progression的图标，选择repeat track即可。

*** 设置输入法切换
在Preferences里面：
- Input Method 里面添加 SunPinyin
- 然后在General里面的Keyboard Shortcuts里面设置Enable or disable设置切换按键
  - Release+Shift_L 左边的Shift键
  - Constrol+space control和空格键
  - 这些都和windows输入法的默认配置很像。

#note: 在Emacs里面需要安装ibus.el以及ibus-agent。但是现在不知道为什么左边的Shift键在Emacs里面一直不能使用。

#note: ibus.el只能支持到了ubuntu12.04, 升级到14.04之后就不能再使用了。所以现在只能使用emacs -nw在终端下工作：（

*** 自动启动输入法
另外系统默认是不会自动启动ibus的，可以在System Settings里面的Language Support里面设置Input method为ibus, 这样ibus就可以自动启动了。如果emacs需要使用ibus的话，那么ibus-daemon必须先于emacs启动。可能这样agent才能够工作。

*** google docs不能输入中文
似乎sunpinyin在google docs下面工作不是很好。使用原来的pinyin就没有问题。what a shame！

*** 设置默认浏览器
System Settings =》 Details 里面可以设置默认浏览器。至于emacs里面的话可以使用如下配置。
#+BEGIN_SRC elisp
(setq browse-url-generic-program (executable-find "chromium-browser")
      browse-url-browser-function 'browse-url-generic)
#+END_SRC

*** thunderbird配置gmail
- pop3 pop.gmail.com SSL/TLS 995 normal password
- smtp smtp.gmail.com SSL/TLS 465 normal password
- #note: 需要确认gmail允许pop3来访问
- 不过似乎现在thunderbird已经非常智能了，只要输入username以及email的话就可以自动进行配置了。nice！！！（现在看起来选择iamp模式也没有什么问题）
- server settings =>
  - 1) leave mesages on server until I delete them. （对于imap模式来说的话，就使用默认移动到Trash下面即可）
  - 2) empty trash on exit.
  - 3) check for new messages at startup.
  - 4) check for new messages every 10 minutes.
- copies and folders => 1) cc these email addresses: dirtysalt1987@gmail.com（如果使用imap模式可以不使用）
- composition and addressing => 1) start my reply above the quote and place my signature below the quote.
- 设置签名

