html/ubuntu.html

<div id="outline-container-sec-2-9" class="outline-3">
<h3 id="sec-2-9"><span class="section-number-3">2.9</span> deb使用</h3>
<div class="outline-text-3" id="text-2-9">
<p>
安装deb使用命令 sudo dpkg -i test.deb. （使用dpkg并不会自动下载.deb所需要的依赖. 这个工作可以通过gdebi来完成）
</p>

<p>
通常我们不太清楚一个deb安装了哪些文件，尤其是doc的话可能不知道放置在什么位置上面。我们可以通过搜索引擎查找这个包，然后在 <a href="http://packages.ubuntu.com">http://packages.ubuntu.com</a> 下面找到这个包以及对应的文件列表信息。
</p>

<p>
doc存放位置通常在/usr/share/doc/&lt;package&gt;/下面。
</p>

<p>
使用alien在deb和rpm之间转换
</p>
<ul class="org-ul">
<li>安装alien
</li>
<li>rpm转deb sudo alien -d test.rpm
</li>
<li>deb转rpm sudo alien -r test.deb
</li>
</ul>

<p>
看了一下alien的help还可和下面几个包格式互转
</p>
<ul class="org-ul">
<li>slp
</li>
<li>lsb
</li>
<li>tgz
</li>
<li>pkg
</li>
</ul>
<p>
甚至可以直接调用alien -i test.rpm直接安装而不需要转换。
</p>

<p>
使用dpkg &#x2013;listfiles可以查看安装了哪些文件
</p>

<hr  />

<p>
使用apt-cache depends &lt;package&gt;可以查看&lt;package&gt;的依赖，rdepends则可是查看反向依赖
</p>
<pre class="example">
➜  debs git:(devel-yan) ✗ apt-cache rdepends tcpdump
tcpdump
Reverse Depends:
  tcpdump:i386
  kubuntu-active
  tcpdump:i386
  ulogd2-pcap
  tcptrace
  tcpstat
  tcpflow
  ssldump
  python-scapy
  python-ns3-dbg
  python-ns3
  pcapfix
  nstreams
  kubuntu-active
  iptotal
  dhcpdump
  core-network-gui
  core-network
  chaosreader
 |bittwist
  ubuntu-standard
➜  debs git:(devel-yan) ✗ apt-cache depends tcpdump
tcpdump
  Depends: libc6
  Depends: libpcap0.8
  Depends: libssl1.0.0
  Suggests: apparmor
  Conflicts: tcpdump:i386
</pre>

<hr  />

<p>
关于制作deb包，下面两个链接比较有帮助
</p>
<ul class="org-ul">
<li>Debian Binary Package Building HOWTO : <a href="http://tldp.org/HOWTO/html_single/Debian-Binary-Package-Building-HOWTO/">http://tldp.org/HOWTO/html_single/Debian-Binary-Package-Building-HOWTO/</a> （制作最简单的deb包）
</li>
<li>Debian Policy Manual - Package maintainer scripts and installation procedure : <a href="https://www.debian.org/doc/debian-policy/ch-maintainerscripts.html">https://www.debian.org/doc/debian-policy/ch-maintainerscripts.html</a> （deb hook脚本运行机制）
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2-10" class="outline-3">
<h3 id="sec-2-10"><span class="section-number-3">2.10</span> apt-get: Waiting for headers</h3>
<div class="outline-text-3" id="text-2-10">
<p>
<a href="http://askubuntu.com/questions/156650/apt-get-update-very-slow-stuck-at-waiting-for-headers">http://askubuntu.com/questions/156650/apt-get-update-very-slow-stuck-at-waiting-for-headers</a>
</p>

<p>
可能是因为网络链接不太好，也可能是因为源服务器不太稳定。如果确定是自己源服务器不太稳定的话，那么可以更换源服务器。
</p>

<p>
Update Manager -&gt; Settings -&gt; Ubuntu Software -&gt; Download from Other -&gt; Select Best Server
</p>
</div>
</div>

<div id="outline-container-sec-2-11" class="outline-3">
<h3 id="sec-2-11"><span class="section-number-3">2.11</span> /sbin/insserv: No such file or directory</h3>
<div class="outline-text-3" id="text-2-11">
<p>
这个命令会在chkconfig(用于配置是否自动启动)里面用到.
</p>

<pre class="example">
➜  nginx  sudo chkconfig lighttpd off
/sbin/insserv: No such file or directory
</pre>

<p>
解决办法是做个软链接 "sudo ln -s  /usr/lib/insserv/insserv /sbin/insserv"
</p>
</div>
</div>

<div id="outline-container-sec-2-12" class="outline-3">
<h3 id="sec-2-12"><span class="section-number-3">2.12</span> 允许/禁止服务自动启动</h3>
<div class="outline-text-3" id="text-2-12">
<p>
chkconfig可以用来配置服务是否自动启动 sudo chkconfig &lt;service&gt; on/off
</p>

<p>
另外使用chkconfig还可以用来查看当前服务自动启动情况
</p>
<pre class="example">
➜  nginx  chkconfig
distcc                   on
docker                   off
lighttpd                 off
mysql                    off
nginx                    on
ntp                      on
ondemand                 on
openvpn                  on
redis-server             off
resolvconf               off
rsync                    on
rsyslog                  off
samba                    off
samba-ad-dc              off
saned                    on
screen-cleanup           off
screen-cleanup.dpkg-new  off
sendsigs                 0
smbd                     off
speech-dispatcher        on
ssh                      off
sudo                     on
sysstat                  on
virtualbox               on
virtualbox-guest-utils   on
virtualbox-guest-x11     on
</pre>

<p>
#note@2014-11-30: ubuntu后期版本移除了这个组件,使用sysv-rc-conf来代替. 使用&#x2013;list可以列出所有当前服务
</p>
<pre class="example">
➜  .private  sudo sysv-rc-conf --list
collectl     0:off1:off2:on3:on4:on5:on6:off
distcc       0:off1:off2:on3:on4:on5:on6:off
docker
mysql        2:off3:off4:off5:off
ntp          1:off2:on3:on4:on5:on
rc.local     2:on3:on4:on5:on
reboot       6:on
redis-server 0:off1:off2:off3:off4:off5:off6:off
resolvconf
rsync        2:on3:on4:on5:on
rsyslog
samba
sudo         2:on3:on4:on5:on
sysstat      2:on3:on4:on5:on
urandom      0:on6:onS:on
virtualbox   0:off1:off2:on3:on4:on5:on6:off
virtualbox-g 0:off1:off2:on3:on4:on5:on6:off
</pre>

<p>
然后使用sudo sysv-rc-conf &lt;service&gt; on/off 来配置是否自动启动
</p>
</div>
</div>

<div id="outline-container-sec-2-13" class="outline-3">
<h3 id="sec-2-13"><span class="section-number-3">2.13</span> 修改分区</h3>
<div class="outline-text-3" id="text-2-13">
<p>
可以使用Ubuntu Disk工具来修改分区。
</p>

<p>
修改分区之后可能会在启动时候出现错误，显示这些分区不存在无法挂载。可能的原因是这些分区的UUID发生变化，但是在/etc/fstab里面却没有更新过来。
</p>

<p>
我们可以手工编辑/etc/fstab来更正，可以使用blkid查看各个设备的UUID
</p>
<pre class="example">
➜  ~  blkid
/dev/sda1: UUID="26971214-3b4d-455c-ab3d-cefae2d8cfd8" TYPE="ext4"
/dev/sda5: LABEL="swap" UUID="cd6de3d9-6a98-46c2-9875-de12251fe82e" TYPE="swap"
/dev/sda6: LABEL="extra" UUID="6ac0d95d-b2fc-426f-bf7b-4a3669442ea6" TYPE="ext4"
/dev/sdb2: UUID="4ed192d5-884b-43a4-904b-fb9cb5f193b2" TYPE="ext4"
</pre>
</div>
</div>

<div id="outline-container-sec-2-14" class="outline-3">
<h3 id="sec-2-14"><span class="section-number-3">2.14</span> 设置apt源</h3>
<div class="outline-text-3" id="text-2-14">
<p>
好的apt源可以加快软件安装，节省不少时间。默认源mirrors.ubuntu.com离中国比较远所以下载会很慢。
</p>

<p>
Ubuntu Software Center -&gt; Edit -&gt; Software Sources -&gt; Ubuntu Sofware(Download from)
</p>

<p>
点击Select Best Server来让自动选择最好的服务器。如果是中国的话可能163.com或者是aliyun.com会比较好点。修改完成后记得要apt-get update.
</p>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> 桌面应用</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> amarok循环播放</h3>
<div class="outline-text-3" id="text-3-1">
<p>
在amarok的右下角有task progression的图标，选择repeat track即可。
</p>
</div>
</div>

<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> 设置输入法切换</h3>
<div class="outline-text-3" id="text-3-2">
<p>
在Preferences里面：
</p>
<ul class="org-ul">
<li>Input Method 里面添加 SunPinyin
</li>
<li>然后在General里面的Keyboard Shortcuts里面设置Enable or disable设置切换按键
<ul class="org-ul">
<li>Release+Shift_L 左边的Shift键
</li>
<li>Constrol+space control和空格键
</li>
<li>这些都和windows输入法的默认配置很像。
</li>
</ul>
</li>
</ul>

<p>
#note: 在Emacs里面需要安装ibus.el以及ibus-agent。但是现在不知道为什么左边的Shift键在Emacs里面一直不能使用。
</p>

<p>
#note: ibus.el只能支持到了ubuntu12.04, 升级到14.04之后就不能再使用了。所以现在只能使用emacs -nw在终端下工作：（
</p>
</div>
</div>

<div id="outline-container-sec-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> 自动启动输入法</h3>
<div class="outline-text-3" id="text-3-3">
<p>
另外系统默认是不会自动启动ibus的，可以在System Settings里面的Language Support里面设置Input method为ibus, 这样ibus就可以自动启动了。如果emacs需要使用ibus的话，那么ibus-daemon必须先于emacs启动。可能这样agent才能够工作。
</p>
</div>
</div>

<div id="outline-container-sec-3-4" class="outline-3">
<h3 id="sec-3-4"><span class="section-number-3">3.4</span> google docs不能输入中文</h3>
<div class="outline-text-3" id="text-3-4">
<p>
似乎sunpinyin在google docs下面工作不是很好。使用原来的pinyin就没有问题。what a shame！
</p>
</div>
</div>

<div id="outline-container-sec-3-5" class="outline-3">
<h3 id="sec-3-5"><span class="section-number-3">3.5</span> 设置默认浏览器</h3>
<div class="outline-text-3" id="text-3-5">
<p>
System Settings =》 Details 里面可以设置默认浏览器。至于emacs里面的话可以使用如下配置。
</p>
<div class="org-src-container">

<pre class="src src-elisp">(<span class="org-keyword">setq</span> browse-url-generic-program (executable-find <span class="org-string">"chromium-browser"</span>)
      browse-url-browser-function 'browse-url-generic)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3-6" class="outline-3">
<h3 id="sec-3-6"><span class="section-number-3">3.6</span> thunderbird配置gmail</h3>
<div class="outline-text-3" id="text-3-6">
<ul class="org-ul">
<li>pop3 pop.gmail.com SSL/TLS 995 normal password
</li>
<li>smtp smtp.gmail.com SSL/TLS 465 normal password
</li>
<li>#note: 需要确认gmail允许pop3来访问
</li>
<li>不过似乎现在thunderbird已经非常智能了，只要输入username以及email的话就可以自动进行配置了。nice！！！（现在看起来选择iamp模式也没有什么问题）
</li>
<li>server settings =&gt;
<ul class="org-ul">
<li>1) leave mesages on server until I delete them. （对于imap模式来说的话，就使用默认移动到Trash下面即可）
</li>
<li>2) empty trash on exit.
</li>
<li>3) check for new messages at startup.
</li>
<li>4) check for new messages every 10 minutes.
</li>
</ul>
</li>
<li>copies and folders =&gt; 1) cc these email addresses: dirtysalt1987@gmail.com（如果使用imap模式可以不使用）
</li>
<li>composition and addressing =&gt; 1) start my reply above the quote and place my signature below the quote.
</li>
<li>设置签名
</li>
</ul>
</div>
</div>
