src/ubuntu.org
*** thunderbird的Inbox文件过大
- http://blog.tianya.cn/blogger/post_read.asp?BlogID=3802303&PostID=35373429

在安装新的操作系统时候，可能需要将原来的邮件全部迁移过去。thunderbird迁移邮件非常方便。在C:\Documents and Settings\\Application Data\Thunderbird\Profiles\wkq5wydz.default\Mail\ 下面会有你这个pop-server对应的文件，比如Inbox(对应thunderbird的收件箱),Drafts(对应thunderbird的草稿箱）等。将这些文件直接copy过去就OK了。不得不说这点非常方便：）

但是我们会遇到一个问题就是Inbox文件太大了。而且如果我们在thunderbird下面删除收件箱里面内容的话，会发现这个Inbox文件其实没有发生变化。原因是因为thunderbird采用标记删除，所以原来的邮件内容依然是保存的（也就是说如果我们通过修改Inbox里面的标记位是可以恢复的，而且这个工作不难，因为阅读Inbox的内容就会发现里面保存的文本格式。不过谨慎选用编辑器，不要将Inbox内容全部载入不然内存会爆掉的）。 *解决这个问题非常简单，就是在thunderbird下面针对这个文件夹右键点击压缩。对于草稿箱和其他的文件夹是一样的操作。而且在thunderbird下面有工具->选项->高级->网络&磁盘空间里面，可以选择如果超过过大的话就会进行压缩。*

作为后端开发者，觉得thunderbird这样做是很正常的。有几种方式：
1. 一种是用小碎片文件来解决，每个小碎片文件对应一个邮件，但是这样邮件太多的话性能和碎片会成为问题，但是增加和删除都非常方便
2. 另外就是使用大文件来追加写，然后针对每封邮件进行索引。索引可以保存在内存里面并且定期dump出去，启动时候检查索引是否和文件对应，不对应的话那么可能需要增量做一部分索引。但是这样删除会成为问题，标记删除可能就是最好的办法了。所以需要用户手动或者是通过程序判断磁盘文件大小来触发压缩。
3. 使用数据库本质上和2是一样的，只不过可以在一定程度上简化代码。在删除方便可能还是使用压缩删除。如果是我自己做的话那么可能考虑使用sqlite来做。单机可以embed,并且通过SQL来进行检索或者是其他操作。

#note: 其实thunderbird超过一定大小就会自动提醒是否需要压缩

*** 窗口常用快捷键
- Ctrl+Alt+T // 打开一个terminal。
- Ctrl+Alt+上下左右 // 在不同的workspace之间切换。

*** 调整字体大小
System Settings =》 Universal Access里面的Seeing部分可以用来调整字体大小。但是只有等级没有具体的数字可以进行调整。
可以通过安装gnome-tweak-tool并且运行之来进行微调。

参考链接 http://ltek.dyndns.org/wordpress/?p=282

*** 调整边栏大小
System Settings => Appearance => Launcher icon size.

*** 调整skype字体大小
http://www.mintos.org/network/modify-skype-font.html

- 安装qt4-config "sudo apt-get install qt4-qtconfig"
- 修改字体(font size=12)和外观(Clearlooks)
- 点击qt4-config的菜单栏保存
- 重启skype即可观察到字体修改效果

*** vlc字幕乱码
Tools -> Preferences -> Subtitles & OSD

使用默认的编码(encoding)就行，然后选择font为"WenQuanYi Micro Hei"(默认的字体应该是不能够显示中文)

*** 使用搜狗输入法
搜狗输入法依赖于fcitx框架，所以必须先安装好fcitx. 然后从搜狗输入法主页上下载deb进行安装。http://pinyin.sogou.com/linux/?r=pinyin

通常系统会安装多种输入法框架比如ibus/fcitx，所以我们必须配置使用什么输入法框架，这个工作可以通过im-switch/im-config来完成。

因为搜狗输入法是基于云的输入法，所以输入效果相比单机输入法比如sunpinyin会好很多。安装完成之后需要重启X.

#note: fcitx-googlepinyin也不错

** 编程环境
*** bash的tab自动补全
"sudo apt-get install bash-completion"

但是我觉得这个自动补全有点不太好的就是，比如我cd ~/.ssh/想自动补全的话，我不仅仅是希望能够补全目录(虽然cd参数只能够是目录),我还希望可以显示文件(比如我想知道这个目录下面是否有Makefile或者是pom.xml)，这样就可以快速判断某个文件是否在目录下面。不然我只能调回命令行开头，切换成为cat,然后跳回去使用两次tab进行自动补全(cat能够显示文件).

这个自动补全配置文件在/etc/bash_completion下面。阅读代码发现可能是和file_dir这个函数相关。调用时候使用file_dir -d的话只会显示目录，而file_dir的话就会显示所有。所以最简单的做法就是将file_dir -d全部替换成为file_dir. done!!!

*** 加快ssh登陆
对于服务器的话可以修改/etc/ssh/sshd_config
#+BEGIN_EXAMPLE
    UseDNS no

#+END_EXAMPLE
对于客户端的话可以修改/etc/ssh/ssh_config
#+BEGIN_EXAMPLE
    GSSAPIAuthentication no
    GSSAPIDelegateCredentials no
#+END_EXAMPLE

*** 建立ssh信任关系
关于sshd机器之间的信任关系，很多文章都有介绍。大致方法就是：
1. 在自己机器上面ssh-keygen生成~/.ssh/id_rsa{.pub}.其中.pub文件是公钥
2. 然后将id_rsa.pub内容copy到另外机器下面的~/.ssh/authorized_keys里面(注意chmod 600)
3. 接着本地的.pub文件就可以删除
这个密钥是可以在不同机器上面使用的，也就是说你只需要生成一次即可

我猜想大致工作过程应该是这样的：
1. 在ssh建立连接的时候，本地ssh-client会读取~/.ssh/id_rsa内容
2. 建立好连接之后会将rsa内容发给对端机器，对端机器针对authorized_keys进行验证
3. 如果验证OK的话那么就认为是信任对方的。
具体这些文件放置位置都是可以配置的，关于如何配置可以看man ssh_config(client) / man sshd_config(server). 之前遇到问题就是，在/etc/sshd_config里面修改了认证文件的位置，不是放在authorized_keys里面而是放在cloud_keys里面!!!

对于这种东西我觉得还是使用默认的比较好，convention over configuration!!!

-----

如果登陆过程中出现 "Agent admitted failure to sign using the key" 的话，可以尝试下面的命令
#+BEGIN_EXAMPLE
ssh-add   ~/.ssh/id_rsa
#+END_EXAMPLE

*** 简化ssh登陆
简化ssh登陆第一个方式就是去除密码输出，这个可以通过配置信任关系完成。

简化ssh登陆第二个方式就是可以针对hostname,user以及port做别名，这个可以在~/.ssh/config里面配置
#+BEGIN_EXAMPLE
    dirlt@dirlt-virtual-machine:~/.ssh$ cat config
    Host git
    Port 16024
    HostName git.fm
    User dirtysalt
#+END_EXAMPLE
这样之后通过ssh git的话就相当于ssh -l dirtysalt -p 16021 git.fm.非常方便。

*** 修改默认shell
sudo chsh -s /bin/zsh dirlt

似乎需要重启才能够生效

*** 关闭ssh host key检查
How to disable SSH host key checking http://linuxcommando.blogspot.com/2008/10/how-to-disable-ssh-host-key-checking.html
- UserKnownHostsFile /dev/null
- StrictHostKeyCheckin no

*** ssh identity file
如果你的ssh identity file配置很多的话，有时候登录会出现"Too many authentication failures"的错误。这是因为ssh会使用你所有添加的identity files来尝试验证（比如4个），但是服务器配置最多3次验证的话那么最后一个identity file就不会被验证了，即使这个identity file是正确的。更常见的情况是历史上你可能无意添加了许多identity file，可是这些file到现在基本上都过时了，所以你需要清理一下。

查看所配置的identity files很简单'ssh-add -l'. 使用选项-d可以删除某个file(-D可以删除所有)
#+BEGIN_EXAMPLE
➜  repo  ssh-add -l
2048 37:0d:f1:91:c8:96:97:9a:54:8b:da:66:41:19:9f:a3 /home/dirlt/.ssh/id_rsa (RSA)
2048 b9:56:e7:7d:83:d4:04:70:c4:bb:0b:9e:3d:05:63:a6 /home/dirlt/.ssh/github (RSA)
1024 c5:a4:a2:c0:8b:12:68:81:9e:dc:c0:30:79:f7:a8:f6 /home/dirlt/.ssh/lz5-devel (DSA)
➜  repo  ssh-add -d /home/dirlt/.ssh/id_rsa
Identity removed: /home/dirlt/.ssh/id_rsa ( dirlt@ubuntu)
➜  repo  ssh-add -l
2048 b9:56:e7:7d:83:d4:04:70:c4:bb:0b:9e:3d:05:63:a6 /home/dirlt/.ssh/github (RSA)
1024 c5:a4:a2:c0:8b:12:68:81:9e:dc:c0:30:79:f7:a8:f6 /home/dirlt/.ssh/lz5-devel (DSA)
#+END_EXAMPLE

[[http://stackoverflow.com/questions/25464930/how-to-remove-a-ssh-key][还有一些entry不是直接对应file的]]， 所以没有办法使用ssh-add -d来删除。可以在"Passwords and Keys"这个应用程序里面删除掉。

*** cannot change locale
通常是因为对应的locale没有找到
#+BEGIN_EXAMPLE
bash: warning: setlocale: LC_ALL: cannot change locale (zh_CN.UTF-8)
bash: warning: setlocale: LC_ALL: cannot change locale (zh_CN.UTF-8)
bash: warning: setlocale: LC_ALL: cannot change locale (zh_CN.UTF-8)
#+END_EXAMPLE

可以通过生成对应locale文件来解决这个问题
#+BEGIN_EXAMPLE
➜  bin  sudo locale-gen zh_CN.UTF-8
[sudo] password for dirlt:
/bin/bash: warning: setlocale: LC_ALL: cannot change locale (zh_CN.UTF-8)
Generating locales...
  zh_CN.UTF-8... /usr/sbin/locale-gen: line 177: warning: setlocale: LC_ALL: cannot change locale (zh_CN.UTF-8)
done
Generation complete.
#+END_EXAMPLE

** 虚拟机
