html/ubuntu.html

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> 虚拟机</h2>
<div class="outline-text-2" id="text-5">
</div><div id="outline-container-sec-5-1" class="outline-3">
<h3 id="sec-5-1"><span class="section-number-3">5.1</span> vmware虚拟机增加磁盘空间</h3>
<div class="outline-text-3" id="text-5-1">
<p>
今天感觉自己的磁盘空间好像有点不够了，大部分数据都是在$HOME下面的，需要增加磁盘空间。
</p>

<p>
使用vmware disk expand似乎不太好用，虽然磁盘空间增大了，但是df -h发现识别的硬盘大小还是一样（可能需要重新格式化才行）：（。
</p>

<p>
另外一个办法，就是在vmware下面再增加一个disk. 128G,识别为/dev/sdb。然后在linux下面
</p>
<ol class="org-ol">
<li>fdisk为/dev/sdb创建分区，partition number=1.
</li>
<li>partprobe /dev/sdb1 （？具体什么用途我也不太清楚，inform OS partition table changed)
</li>
<li>mkfs.ext4 /dev/sdb1 格式化文件系统
</li>
</ol>
<p>
产生这个硬盘之后，可以首先将自己的$HOME重命名，然后mount /dev/sdb1 $HOME.
</p>

<p>
接着将原来数据copy过去，最好使用cp -r .*这样可以copy隐藏文件。然后需要chown owner:owner .* -R来修改权限（因为这个步骤通常是root操作的）。然后将原来的数据删除即可。
</p>

<p>
之后为了自动挂载，修改/etc/fstab
</p>
<pre class="example">
/dev/sdb1 $HOME ext4 defaults 0 0
</pre>
</div>
</div>

<div id="outline-container-sec-5-2" class="outline-3">
<h3 id="sec-5-2"><span class="section-number-3">5.2</span> virtualbox安装windows虚拟机</h3>
<div class="outline-text-3" id="text-5-2">
<p>
安装windows虚拟机主要是为了方便一些需要在windows下面完成的操作，比如U盾。
另外windows下面也有一些第三方的软件在Linux下面比较匮乏比如EverBox，
虽然DropBox也非常不错但是相对来说还是国内服务器会比较好一些。
</p>

<p>
使用virtualbox，通过加载windows xp的镜像安装，这个非常简单。
或者是直接使用别人生成好的.vdi文件。vdi全称应该是virtual disk image。
</p>

<p>
#note: 升级内核或者是重装系统的话，可能会造成内核版本与默认源的virtualbox不匹配，可以从官网下载最新版本。参考链接 <a href="https://www.virtualbox.org/wiki/Linux_Downloads">https://www.virtualbox.org/wiki/Linux_Downloads</a>
</p>
</div>
</div>

<div id="outline-container-sec-5-3" class="outline-3">
<h3 id="sec-5-3"><span class="section-number-3">5.3</span> virtualbox设置共享文件夹</h3>
<div class="outline-text-3" id="text-5-3">
<p>
设置共享文件夹主要是为了数据可以进行同步。通过windows虚拟机，安装同步软件比如GDrive。
然后通过共享文件夹，将GDrive的同步目录隐射到Linux文件系统上面，完成数据同步。
</p>

<ul class="org-ul">
<li>首先挂载VBoxAdditions.iso,这个文件在/usr/share/virtualbox下面
</li>
<li>之后就会在虚拟机里面提示安装相关的驱动程序。
</li>
<li>完成之后在设置virtualbox的settings/share folder，创建本地share folder
</li>
<li>然后进入虚拟机“我的电脑”右键选择映射网络驱动器，通过浏览可以找到对应的网络驱动器。
</li>
</ul>

<p>
我是参考这篇图文并茂的文章的 <a href="http://hi.baidu.com/hifinan/item/79f22545a8400ed3c1a592f3">http://hi.baidu.com/hifinan/item/79f22545a8400ed3c1a592f3</a>
</p>
</div>
</div>

<div id="outline-container-sec-5-4" class="outline-3">
<h3 id="sec-5-4"><span class="section-number-3">5.4</span> virtualbox下使用U盾</h3>
<div class="outline-text-3" id="text-5-4">
<p>
首先需要在 <a href="https://www.virtualbox.org/wiki/Downloads">https://www.virtualbox.org/wiki/Downloads</a> VirtualBox Extension Pack，双击执行。
在Settings =》 USB选项里面勾选 Enable USB Controller 和 Enable USB2.0（EHCI） Controller。
</p>

<p>
然后我们需要添加vboxusers这个群组，同时将自己加入到这个群组内：
</p>
<ul class="org-ul">
<li>sudo groupadd vboxusers
</li>
<li>sudo gpasswd -a dirlt vboxusers
</li>
</ul>
<p>
接着重新启动ubuntu。
</p>

<p>
接着Settings =》 USB里面添加那些已经识别的设备，接着启动windows虚拟机就可以使用U盾了。
</p>
</div>
</div>
</div>
</div>
</body>
</html>
